#Использовать lambdas

Функция ДействиеИзПараметров(ОписаниеФункции, Интерфейс, ДополнительныеПараметры, Отладка = Ложь) Экспорт

	Если ТипЗнч(ОписаниеФункции) = Тип("Строка") Тогда

		ЛямбдаВыражение = Лямбда.Выражение(ОписаниеФункции)
			.Интерфейс(Интерфейс)
			.Отладка(Отладка);

		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
			ЛямбдаВыражение.Контекст(ДополнительныеПараметры);
		ИначеЕсли Не ДополнительныеПараметры = Неопределено Тогда
			ЛямбдаВыражение.ЗахватитьОбъект(ДополнительныеПараметры);
		КонецЕсли;

		Действие = ЛямбдаВыражение.ВДействие();

	Иначе

		Действие = ОписаниеФункции;

	КонецЕсли;

	Возврат Действие;

КонецФункции
