Функция ВыполнитьВПятьПотоков(
	Сценарий,
	ИмяМетода,
	Параметр = Неопределено,
	ВторойПараметр = Неопределено,
	ТретийПараметр = Неопределено) Экспорт
	
	Параметры = Новый Массив;

	Если Не Параметр = Неопределено Тогда
		Параметры.Добавить(Параметр);
	КонецЕсли;

	Если Не ВторойПараметр = Неопределено Тогда
		Параметры.Добавить(ВторойПараметр);
	КонецЕсли;

	Если Не ТретийПараметр = Неопределено Тогда
		Параметры.Добавить(ТретийПараметр);
	КонецЕсли;

	Задания = Новый Массив();

	Для Счетчик = 1 По 5 Цикл // BSLLS:UnusedLocalVariable-off

		Задания.Добавить(
			ФоновыеЗадания.Выполнить(Сценарий, ИмяМетода, Параметры)
		);

	КонецЦикла;

	ФоновыеЗадания.ОжидатьВсе(Задания);

	Для каждого ФоновоеЗадание Из Задания Цикл

		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			ВызватьИсключение ФоновоеЗадание.ИнформацияОбОшибке;
		КонецЕсли;

	КонецЦикла;

	Результаты = Новый Массив;

	Для каждого ФоновоеЗадание Из Задания Цикл
		Результаты.Добавить(ФоновоеЗадание.Результат);
	КонецЦикла;

	Возврат Результаты;

КонецФункции

Функция Массив(Параметр = NULL, ВторойПараметр = NULL, ТретийПараметр = NULL) Экспорт
	Результат = Новый Массив;

	Если Параметр <> NULL Тогда
		Результат.Добавить(Параметр);
	КонецЕсли;

	Если ВторойПараметр <> NULL Тогда
		Результат.Добавить(ВторойПараметр);
	КонецЕсли;

	Если ТретийПараметр <> NULL Тогда
		Результат.Добавить(ТретийПараметр);
	КонецЕсли;

	Возврат Результат;

КонецФункции