Перем Значение; // Текущее значение
Перем Блокировка; // Блокировка для изменения значения

// Получает текущее значение атомарного булева
//
// Возвращаемое значение:
//   Булево - текущее значение
//
Функция Получить() Экспорт
	Блокировка.Заблокировать();
	Результат = Значение;
	Блокировка.Разблокировать();
	Возврат Результат;
КонецФункции

// Устанавливает новое значение атомарного булева
//
// Параметры:
//   НовоеЗначение - Булево - новое значение
//
Процедура Установить(Знач НовоеЗначение) Экспорт
	ПроверитьТип(НовоеЗначение);
	Блокировка.Заблокировать();
	Значение = НовоеЗначение;
	Блокировка.Разблокировать();
КонецПроцедуры

// Получает текущее значение и устанавливает новое
//
// Параметры:
//   НовоеЗначение - Булево - новое значение
//
// Возвращаемое значение:
//   Булево - предыдущее значение
//
Функция ПолучитьИУстановить(Знач НовоеЗначение) Экспорт
	ПроверитьТип(НовоеЗначение);
	Блокировка.Заблокировать();
	Результат = Значение;
	Значение = НовоеЗначение;
	Блокировка.Разблокировать();
	Возврат Результат;
КонецФункции

// Сравнивает текущее значение с ожидаемым и устанавливает новое при успехе
//
// Параметры:
//   ОжидаемоеЗначение - Булево - ожидаемое значение
//   НовоеЗначение - Булево - новое значение
//
// Возвращаемое значение:
//   Булево - Истина если обновление прошло успешно, Ложь иначе
//
Функция СравнитьИУстановить(Знач ОжидаемоеЗначение, Знач НовоеЗначение) Экспорт
	ПроверитьТип(НовоеЗначение);
	Блокировка.Заблокировать();
	Результат = Значение = ОжидаемоеЗначение;
	Если Результат Тогда
		Значение = НовоеЗначение;
	КонецЕсли;
	Блокировка.Разблокировать();
	Возврат Результат;
КонецФункции

Процедура ПроверитьТип(НовоеЗначение)
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		ВызватьИсключение "Устанавливаемое значение должно быть типа булево";
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Представление, СтандартнаяОбработка) // BSLLS:UnusedLocalMethod-off
	СтандартнаяОбработка = Ложь;
	Представление        = Строка(Получить());
КонецПроцедуры

Процедура ПриСозданииОбъекта(НачальноеЗначение = Ложь)
	ПроверитьТип(НачальноеЗначение);
	Значение = НачальноеЗначение;
	Блокировка = Новый БлокировкаРесурса(ЭтотОбъект);
КонецПроцедуры
