Перем Значение; // Атомарное число хранящее значение

// Получает текущее значение атомарного булева
//
// Возвращаемое значение:
//   Булево - текущее значение
//
Функция Получить() Экспорт
	Возврат Булево(Значение.Получить());
КонецФункции

// Устанавливает новое значение атомарного булева
//
// Параметры:
//   НовоеЗначение - Булево - новое значение
//
Процедура Установить(Знач НовоеЗначение) Экспорт
	ПроверитьТип(НовоеЗначение);
	Значение.Установить(Число(НовоеЗначение));
КонецПроцедуры

// Получает текущее значение и устанавливает новое
//
// Параметры:
//   НовоеЗначение - Булево - новое значение
//
// Возвращаемое значение:
//   Булево - предыдущее значение
//
Функция ПолучитьИУстановить(Знач НовоеЗначение) Экспорт
	ПроверитьТип(НовоеЗначение);
	Возврат Булево(Значение.ПолучитьИУстановить(Число(НовоеЗначение)));
КонецФункции

// Сравнивает текущее значение с ожидаемым и устанавливает новое при успехе
//
// Параметры:
//   ОжидаемоеЗначение - Булево - ожидаемое значение
//   НовоеЗначение - Булево - новое значение
//
// Возвращаемое значение:
//   Булево - Истина если обновление прошло успешно, Ложь иначе
//
Функция СравнитьИУстановить(Знач ОжидаемоеЗначение, Знач НовоеЗначение) Экспорт
	ПроверитьТип(НовоеЗначение);
	Возврат Булево(Значение.СравнитьИУстановить(Число(ОжидаемоеЗначение), Число(НовоеЗначение)));
КонецФункции

Процедура ПроверитьТип(НовоеЗначение)
	Если ТипЗнч(НовоеЗначение) <> Тип("Булево") Тогда
		ВызватьИсключение "Устанавливаемое значение должно быть типа булево";
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Представление, СтандартнаяОбработка) // BSLLS:UnusedLocalMethod-off
	СтандартнаяОбработка = Ложь;
	Представление        = Строка(Получить());
КонецПроцедуры

Процедура ПриСозданииОбъекта(НачальноеЗначение = Ложь)
	ПроверитьТип(НачальноеЗначение);
	Значение = Новый АтомарноеЧисло(Число(НачальноеЗначение));
КонецПроцедуры
